Tekla Open API Reference for Tekla Structures 2025
AnalysisPart Methods
The AnalysisPart type exposes the following members.
Methods
Name | Description
Add(AnalysisArea)
 Adds an analysis area to the analysis part.
Add(AnalysisBar)
 Adds an analysis bar to the analysis part.
Delete
 Deletes an analysis part. The method is not implemented.
DeleteAnalysisPart
 Deletes the analysis part by ID.
GetAnalysisAreas
 Gets the analysis areas of the analysis part.
GetAnalysisBars
 Gets the analysis bars of the analysis part.
GetAnalysisVolumes
 Gets the analysis volumes of the analysis part.
GetMainParts
 Get the main analysis parts of this analysis part. There are no main analysis parts if this is not a sub analysis part.
GetSubParts
 Get the sub analysis parts of this analysis part. There are no sub analysis parts if this is not a main analysis part.
Insert
 Inserts a new analysis part into the Tekla Structures model. The AnalysisModelName has to be set.
IsMainPart
 Check if this analysis part is a main analysis part (has sub analysis parts).
IsSubPart
 Check if this analysis part is a sub analysis part.
Modify
 Modifies an analysis part. The ID, or the PartID and the AnalysisModelName, has to be set.
MovePosition
 Move analysis position.
Select
 Selects an analysis part. The ID, or the PartID and the AnalysisModelName, has to be set.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
AnalysisPart Class
Tekla.Structures.Analysis Namespace